src/Catalogs/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Comment>0-строго по сетке, 1-по цене на начало , 2-фиксированная цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасшифровки</Name>
					<Comment>0-без расшифровки, 1-общий период, 2-подробно</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПодготовки</Name>
					<Comment>в течение которого можно отказаться без оплаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЦены</Name>
					<Comment>за что указывается цена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дискретность</Name>
					<Comment>тарифицируемого времени</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинВремя</Name>
					<Comment>на которое можно оформить заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДаты</Name>
					<Comment>для интервалов времени</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>если фиксированная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>для обновления тарифных сеток в РМ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифнаяСетка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Тарифы/Ext/ObjectModule.bsl
// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВремяЦены) Тогда
		Сообщить("Укажите базовую единицу времени",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Дискретность) Тогда
		Сообщить("Укажите дискретность тарификации",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ПравилоОкругления) Тогда
		Сообщить("Укажите правило округления!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли ПравилоОкругления.Кратность <> 1 Тогда
		Сообщить("Правило округления для учета времени должно иметь кратность равную единице!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Валюта) Тогда
		Сообщить("Укажите валюту тарифа",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Цена) И ВариантРасчета = 2 Тогда
		Сообщить("Укажите фиксированный тариф",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(МинВремя) Тогда
		Сообщить("Укажите минимальное время заказа!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли МинВремя.Код < Дискретность.Код Тогда
		Сообщить("Минимальное время не может быть меньше дискретности!",СтатусСообщения.Важное);
		Отказ = Истина;
		
	ИначеЕсли ВариантРасчета < 2 И ТарифнаяСетка.Количество() = 0 Тогда
		Сообщить("Необходимо заполнить тарифную сетку",СтатусСообщения.Важное);
		Отказ = Истина;
		
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры
